/** Приложение "Трекер задач". Реализовано на java core.
 *
 * У задачи есть следующие свойства:
 * Название, кратко описывающее суть задачи (например, «Переезд»).
 * Описание, в котором раскрываются детали.
 * Уникальный идентификационный номер задачи, по которому её можно будет найти.
 * Статус, отображающий её прогресс.
 *
 * В системе задачи могут быть трёх типов: обычные задачи, эпики и подзадачи.
 * Для них выполняются выполняться следующие условия:
 * Для каждой подзадачи известно, в рамках какого эпика она выполняется.
 * Каждый эпик знает, какие подзадачи в него входят.
 * Завершение всех подзадач эпика считается завершением эпика.
 *
 * В приложении реализовано два варианта хранения данных: 1)Локально - в формате .csv, 2)На сервере - в формате json**/
public class Main {
    public static void main(String[] args) {

    }
}