package Main;

import TuskManager.Manager;

public class Main {

    public static void main(String[] args) {
        Manager manager = new Manager();

        /* Привет, я тут понаписал какой то ерунды, но вроде всё работает :) Возникло много путаницы с
        параметрами методов, кажется что можно было сделать проще, но не понял как.
        Так же не понимаю как будет происходить управление приложением, поэтому все методы менеджера сделал
        приватными и тестил их работу через паблик метод, который запускал в мейне, не знаю как правильно.
        Проверил методы на добавление, удаление изменение статуса тасков и сабтасков, всё работает.
        При изменении статуса сабтаска запускается метод проверки статуса эпика, тоже вроде всё корректно.
        С нетерпением жду комментариев :)
         */
    }
}
